UPDATE target
SET 
    target.[1_Число_физ_лиц_врачей_гериатров_занято] = source.[1_Число_физ_лиц_врачей_гериатров_занято],
    target.[1_Число_физ_лиц_средн_мед_персонала_занято] = source.[1_Число_физ_лиц_средн_мед_персонала_занято]
FROM [ASMMS].[dbo].[_Старшее_поколение_информация_о_гериатрических_кабинетах] AS target
INNER JOIN [ASMMS].[dbo].[_Старшее_поколение_информация_о_гериатрических_кабинетах] AS source
    ON target.[Наименование_учреждения] = source.[Наименование_учреждения]
    AND target.[Календарный_год] = source.[Календарный_год]
    AND target.[Регион] = source.[Регион] AND target.[Номер_лицензии] = source.[Номер_лицензии] AND target.[Адрес_учреждения] = source.[Адрес_учреждения]
	AND target.[Разграничение_по_таблицам] = source.[Разграничение_по_таблицам]
WHERE target.[Период] = 1014
    AND source.[Период] = 1010
    AND source.[Календарный_год] = 1015
	AND source.[Разграничение_по_таблицам] = 1000
/**
SELECT 
    target.[Наименование_учреждения],
    target.[Регион],
    target.[Календарный_год],
    target.[Период] AS target_period,
    target.[1_Число_физ_лиц_врачей_гериатров_занято] AS current_врачи,
    source.[1_Число_физ_лиц_врачей_гериатров_занято] AS new_врачи,
    target.[1_Число_физ_лиц_средн_мед_персонала_занято] AS current_персонал,
    source.[1_Число_физ_лиц_средн_мед_персонала_занято] AS new_персонал
FROM [ASMMS].[dbo].[_Старшее_поколение_информация_о_гериатрических_кабинетах] AS target
INNER JOIN [ASMMS].[dbo].[_Старшее_поколение_информация_о_гериатрических_кабинетах] AS source
    ON target.[Наименование_учреждения] = source.[Наименование_учреждения]
    AND target.[Календарный_год] = source.[Календарный_год]
    AND target.[Регион] = source.[Регион] AND target.Номер_лицензии = source.Номер_лицензии AND target.Адрес_учреждения = source.Адрес_учреждения
	AND target.[Разграничение_по_таблицам] = source.[Разграничение_по_таблицам]
WHERE target.[Период] = 1014
    AND source.[Период] = 1010
    AND source.[Календарный_год] = 1015
	AND source.[Разграничение_по_таблицам] = 1000
ORDER BY target.[Наименование_учреждения]
**/