SELECT _Регион.Name as [Субъект_РФ]
,_Форма_131_столбцы.Name as [Форма_131_столбцы]
      ,_Форма_131_строки.Name as [Форма_131_строки]
      ,[Период]
      ,_Календарный_год.Name as [Календарный_год]
      ,ISNULL([Value],[Value_Calculated]) as Значение
FROM [ASMMS].[dbo].[__Форма_131_куб]
INNER JOIN _Календарный_год ON
	_Календарный_год.id=[Календарный_год]
INNER JOIN _Форма_131_столбцы ON
	_Форма_131_столбцы.id = [Форма_131_столбцы]
INNER JOIN _Форма_131_строки ON
	_Форма_131_строки.id = [Форма_131_строки]
INNER JOIN _Регион ON
	_Регион.id = [Субъект_РФ]
WHERE [Форма_131_строки] IN (1000, 1001, 1002, 1003, 1296, 1297, 1298, 1299, 1230, 1300, 1301, 1302, 1303, 1304) AND [Период]=1018
ORDER BY _Календарный_год.Name