SELECT pvt.Врачи,
		pvt.номер_строки,
		[постоянные_J_13],
		[постоянные_J_21],
		[постоянные_J_15],
		[постоянные_J_16],
		[постоянные_J_14],
		[постоянные_J_17],
		[постоянные_J_19],
		[постоянные_J_9],
		[постоянные_J_10],
		[постоянные_J_12],
		[J_27_Интегральный_территориальный_коэффициент_для_корректировки_числа_коек],
		[постоянные_J_22],
		[постоянные_J_18],
		[постоянные_J_20],
		[постоянные_J_23],
		[постоянные_J_24],
		[постоянные_J_25],
		[постоянные_J_26],
		[1008] as N'переменные_C_97',
		[1009] as N'переменные_D_97',
		[1010] as N'переменные_E_97',
		[1011]/100 as N'переменные_F_97',
		round([Сумма_C_без_СМП]*(incl.Столбец_D+incl.Столбец_E+incl.Столбец_F+incl.Столбец_G),0) as N'Сумма_C_без_СМП',
		round([Сумма_C]*(incl.Столбец_D+incl.Столбец_E+incl.Столбец_F+incl.Столбец_G),0) as N'Сумма_C',
		[Столбец_C]=case pvt.номер_строки
				WHEN 70 THEN round([Сумма_C]*(incl.Столбец_D+incl.Столбец_E+incl.Столбец_F+incl.Столбец_G),0)-round([Сумма_C_без_СМП]*(incl.Столбец_D+incl.Столбец_E+incl.Столбец_F+incl.Столбец_G),0)
				ELSE round((incl.Столбец_D+incl.Столбец_E+incl.Столбец_F+incl.Столбец_G)*isnull([1011],0)/100,0)
		END,
		[1023] as N'постоянные_J_87',
		t3.Value as N'переменные_F_31',
		t4.Value as N'переменные_F_32',
		t5.Value as N'переменные_F_33',
		[Столбец_I] = CASE pvt.Врачи
			WHEN N'общей практики (семейные)' THEN iif(t3.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t3.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
			WHEN N'педиатры участковые (включая педиатров участковых приписных участков)' THEN iif(t5.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t5.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
			WHEN N'терапевты участковые' THEN iif(t4.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t4.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
			ELSE round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0)
		END,
		[1024] as N'постоянные_C_250',
		ceiling(round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0)*isnull([1024],0)/100) as N'Столбец_J',
		isnull([1025],0) as N'постоянные_D_250',
		isnull([1026],0) as N'постоянные_E_250',
		ceiling((isnull([1025],0) + isnull([1026],0))/100 * 
		sum(
				CASE pvt.Врачи
					WHEN N'общей практики (семейные)' THEN iif(t3.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t3.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
					WHEN N'педиатры участковые (включая педиатров участковых приписных участков)' THEN iif(t5.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t5.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
					WHEN N'терапевты участковые' THEN iif(t4.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t4.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
					ELSE round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0)
				END
			) over (partition by 1)
		) as N'Столбец_K',
		isnull([1027],0) as N'постоянные_F_250',
		ceiling((isnull([1027],0))/100 * 
			sum(
				CASE pvt.Врачи
					WHEN N'общей практики (семейные)' THEN iif(t3.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t3.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
					WHEN N'педиатры участковые (включая педиатров участковых приписных участков)' THEN iif(t5.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t5.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
					WHEN N'терапевты участковые' THEN iif(t4.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t4.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
					ELSE round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0)
				END
				) over (partition by 1)
			) as N'Столбец_L',
		[1028] as N'постоянные_G_250',
		[1029] as N'постоянные_H_250',
		[1030] as N'постоянные_I_250',
		[1031] as N'постоянные_J_250',
		[переменные_C_44], 
		[постоянные_K_44],
		[переменные_C_46],
		[постоянные_K_46],
		[переменные_C_63],
		[постоянные_K_63],
		CEILING(isnull([переменные_C_44],0)/iif(isnull([постоянные_K_44],0)=0,10,[постоянные_K_44]))+CEILING(isnull([переменные_C_46],0)/iif(isnull([постоянные_K_46],0)=0,10,[постоянные_K_46]))+CEILING(isnull([переменные_C_63],0)/iif(isnull([постоянные_K_63],0)=0,10,[постоянные_K_63])) as N'Столбец_M',
		[переменные_E_44],
		[переменные_F_44],
		[постоянные_D_35],
		[постоянные_C_35],
		[постоянные_J_35],
		[переменные_D_44],
		[переменные_E_46],
		[переменные_F_46],
		[постоянные_D_37],
		[постоянные_C_37],
		[постоянные_J_37],
		[переменные_D_46],
		[переменные_E_63],
		[переменные_F_63],
		[постоянные_D_54],
		[постоянные_C_54],
		[постоянные_J_54],
		[переменные_D_63],
		CEILING((max([J_27_Интегральный_территориальный_коэффициент_для_корректировки_числа_коек]) over (partition by 1))*((isnull([переменные_E_44],0)+isnull([переменные_F_44],0))*isnull([постоянные_D_35],0)/iif(isnull([постоянные_C_35],0)=0,334,[постоянные_C_35])/iif(isnull([постоянные_J_35],0)=0,15,[постоянные_J_35])
+(isnull([переменные_E_46],0)+isnull([переменные_F_46],0))*isnull([постоянные_D_37],0)/iif(isnull([постоянные_C_37],0)=0,334,[постоянные_C_37])/iif(isnull([постоянные_J_37],0)=0,15,[постоянные_J_37])
+(isnull([переменные_E_63],0)+isnull([переменные_F_63],0))*isnull([постоянные_D_54],0)/iif(isnull([постоянные_C_54],0)=0,334,[постоянные_C_54])/iif(isnull([постоянные_J_54],0)=0,15,[постоянные_J_54]))) as N'Столбец_O',
		CEILING(isnull([1028],0)*0.01*CEILING([J_27_Интегральный_территориальный_коэффициент_для_корректировки_числа_коек]*((isnull([переменные_E_44],0)+isnull([переменные_F_44],0))*isnull([постоянные_D_35],0)/iif(isnull([постоянные_C_35],0)=0,334,[постоянные_C_35])/iif(isnull([постоянные_J_35],0)=0,15,[постоянные_J_35])
+(isnull([переменные_E_46],0)+isnull([переменные_F_46],0))*isnull([постоянные_D_37],0)/iif(isnull([постоянные_C_37],0)=0,334,[постоянные_C_37])/iif(isnull([постоянные_J_37],0)=0,15,[постоянные_J_37])
+(isnull([переменные_E_63],0)+isnull([переменные_F_63],0))*isnull([постоянные_D_54],0)/iif(isnull([постоянные_C_54],0)=0,334,[постоянные_C_54])/iif(isnull([постоянные_J_54],0)=0,15,[постоянные_J_54])))) as N'Столбец_P',
		CEILING((isnull([1029],0) + isnull([1030],0))*0.01*
		(
			sum(
				ceiling(
							(
								[J_27_Интегральный_территориальный_коэффициент_для_корректировки_числа_коек]
							)*
							(
								(
									isnull([переменные_E_44],0)+isnull([переменные_F_44],0)
								)*
								isnull([постоянные_D_35],0)/
								iif(isnull([постоянные_C_35],0)=0,334,[постоянные_C_35])/
								iif(isnull([постоянные_J_35],0)=0,15,[постоянные_J_35])+
								(
									isnull([переменные_E_46],0)+isnull([переменные_F_46],0)
								)*
								isnull([постоянные_D_37],0)/
								iif(isnull([постоянные_C_37],0)=0,334,[постоянные_C_37])/
								iif(isnull([постоянные_J_37],0)=0,15,[постоянные_J_37])+
								(
									isnull([переменные_E_63],0)+isnull([переменные_F_63],0)
								)*
								isnull([постоянные_D_54],0)/
								iif(isnull([постоянные_C_54],0)=0,334,[постоянные_C_54])/
								iif(isnull([постоянные_J_54],0)=0,15,[постоянные_J_54])
							)
						)
				) over (partition by 1)
		)
		
		) as N'Столбец_Q',
		CEILING((isnull([1031],0))*0.01*(sum(CEILING(([J_27_Интегральный_территориальный_коэффициент_для_корректировки_числа_коек])*((isnull([переменные_E_44],0)+isnull([переменные_F_44],0))*isnull([постоянные_D_35],0)/iif(isnull([постоянные_C_35],0)=0,334,[постоянные_C_35])/iif(isnull([постоянные_J_35],0)=0,15,[постоянные_J_35])
+(isnull([переменные_E_46],0)+isnull([переменные_F_46],0))*isnull([постоянные_D_37],0)/iif(isnull([постоянные_C_37],0)=0,334,[постоянные_C_37])/iif(isnull([постоянные_J_37],0)=0,15,[постоянные_J_37])
+(isnull([переменные_E_63],0)+isnull([переменные_F_63],0))*isnull([постоянные_D_54],0)/iif(isnull([постоянные_C_54],0)=0,334,[постоянные_C_54])/iif(isnull([постоянные_J_54],0)=0,15,[постоянные_J_54])))) over (partition by 1))) as N'Столбец_R',
		CEILING(isnull([переменные_D_44],0)/iif(isnull([постоянные_K_44],0)=0,10,[постоянные_K_44]))+CEILING(isnull([переменные_D_46],0)/iif(isnull([постоянные_K_46],0)=0,10,[постоянные_K_46]))+CEILING(isnull([переменные_D_63],0)/iif(isnull([постоянные_K_63],0)=0,10,[постоянные_K_63])) as N'Столбец_S',
		[1001] as [D19,D21:D26],
		[1002] as [E19:E21:E26],
		[1003] as [F19:F21:F26],
		[Столбец_D]=CASE pvt.Врачи 
			WHEN N'Врачи, всего' THEN ceiling((isnull([1001],0)*4 + isnull([1002],0)*2 + isnull([1003],0))*iif(isnull([постоянные_J_13],0)<=40 AND isnull([постоянные_J_13],0)>20,1.01,iif(isnull([постоянные_J_13],0)>40 AND isnull([постоянные_J_13],0)<=60,1.02,iif(isnull([постоянные_J_13],0)>60,1.03,1)))*iif(isnull([постоянные_J_21],0)=1010,1.01,iif(isnull([постоянные_J_21],0)=1011,1.02,1)))
			ELSE NULL
		END,
		[Столбец_E]=CASE pvt.Врачи 
			WHEN N'Врачи, всего' THEN ceiling((isnull([постоянные_J_15],0)+isnull([постоянные_J_16],0))*iif(isnull([постоянные_J_14],0)=1000,0.3,1)*iif(isnull([постоянные_J_21],0)=1010,1.01,iif(isnull([постоянные_J_21],0)=1011,1.02,1)))
			ELSE NULL
		END,
		[Столбец_F]=CASE pvt.Врачи
			WHEN N'Врачи, всего' THEN ceiling(isnull([постоянные_J_17],0)*iif(isnull([постоянные_J_13],0)<=40,1.01,iif(isnull([постоянные_J_13],0)>40 AND isnull([постоянные_J_13],0)<=60,1.02,iif(isnull([постоянные_J_13],0)>60,1.03,1)))*iif(isnull([постоянные_J_21],0)=1010,1.01,iif(isnull([постоянные_J_21],0)=1011,1.02,1))/0.25)
			ELSE NULL
		END,
		[Столбец_G]=CASE pvt.Врачи
			WHEN N'Врачи, всего' THEN ceiling((isnull([постоянные_J_15],0)+isnull([постоянные_J_16],0))*iif(isnull([постоянные_J_19],0)>=3,1.3,iif(isnull([постоянные_J_19],0)=2,1.2,1))*iif(isnull([постоянные_J_21],0)=1010,1.01,iif(isnull([постоянные_J_21],0)=1011,1.02,1)))
			ELSE NULL
		END,
		isnull([1033],0) as [D_7],
		isnull([1034],0) as [E_7],
		isnull([1035],0) as [F_7],
		isnull([1036],0) as [G_7],
		isnull([1037],0) as [I_7],
		isnull([1038],0) as [J_7],
		isnull([1039],0) as [K_7],
		isnull([1040],0) as [L_7]
FROM  
(
	SELECT [Расчёт_потребности_в_кадрах_Столбцы_2024]
			  ,_Расчёт_потребности_в_кадрах_Строки_2024.alias as Врачи
		  ,_Расчёт_потребности_в_кадрах_Строки_2024.номер_строки as номер_строки

		  ,[Value]

	FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
	INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
		_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
	WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024 < 1174 AND Расчёт_потребности_в_кадрах_Строки_2024>1066

	UNION ALL

	SELECT 
			Расчёт_потребности_в_кадрах_Столбцы_2024,
			Врачи = N'Врачи, всего',
				0 as номер_строки,
				Value
	FROM __Расчет_потребности_в_кадрах_2024_год
	INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = __Расчет_потребности_в_кадрах_2024_год.Расчёт_потребности_в_кадрах_Строки_2024
	WHERE Расчёт_потребности_в_кадрах_Строки_2024 IN (1004,1006,1007,1008,1009,1010,1011) AND Субъект_РФ=@Region
) t
PIVOT
(
	SUM(Value) FOR [Расчёт_потребности_в_кадрах_Столбцы_2024] IN ([1001],[1002],[1003],[1008],[1009],[1010],[1011],[1023],[1024],[1025],[1026],[1027],[1028],[1029],[1030],[1031],[1033],[1034],[1035],[1036],[1037],[1038],[1039],[1040])
) pvt
-------------------------------------	
LEFT JOIN
(
	SELECT pvt2.Врачи, 
			pvt2.[1004] as N'переменные_C_44', 
			pvt2.[1022] as N'постоянные_K_44',
			pvt3.[1004] as N'переменные_C_46',
			pvt3.[1022] as N'постоянные_K_46',
			pvt4.[1004] as N'переменные_C_63',
			pvt4.[1022] as N'постоянные_K_63',
			pvt2.[1006] as N'переменные_E_44',
			pvt2.[1007] as N'переменные_F_44',
			pvt2.[1017] as N'постоянные_D_35',
			pvt2.[1016] as N'постоянные_C_35',
			pvt2.[1021] as N'постоянные_J_35',
			pvt2.[1005] as N'переменные_D_44',
			pvt3.[1006] as N'переменные_E_46',
			pvt3.[1007] as N'переменные_F_46',
			pvt3.[1017] as N'постоянные_D_37',
			pvt3.[1016] as N'постоянные_C_37',
			pvt3.[1021] as N'постоянные_J_37',
			pvt3.[1005] as N'переменные_D_46',
			pvt4.[1006] as N'переменные_E_63',
			pvt4.[1007] as N'переменные_F_63',
			pvt4.[1017] as N'постоянные_D_54',
			pvt4.[1016] as N'постоянные_C_54',
			pvt4.[1021] as N'постоянные_J_54',
			pvt4.[1005] as N'переменные_D_63'
	FROM
	(	
		SELECT [Расчёт_потребности_в_кадрах_Столбцы_2024]
				,_Расчёт_потребности_в_кадрах_Строки_2024.врачебная_должность as Врачи
				,[Value]

		FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
		INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
		WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024<=1066 AND Расчёт_потребности_в_кадрах_Строки_2024 NOT IN (1022,1039,1021,1040,1056,1062,1052) 
	) t2
	PIVOT
	(
		SUM(Value) FOR [Расчёт_потребности_в_кадрах_Столбцы_2024] IN ([1004],[1022],[1006],[1007],[1017],[1016],[1021],[1005])
	) pvt2

	LEFT JOIN
	(	
		SELECT [Расчёт_потребности_в_кадрах_Столбцы_2024]
				,_Расчёт_потребности_в_кадрах_Строки_2024.врачебная_должность as Врачи
				,[Value]

		FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
		INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
		WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024<=1066 AND Расчёт_потребности_в_кадрах_Строки_2024 IN (1022,1021,1040,1056,1062,1052)
	) t3
	PIVOT
	(
		SUM(Value) FOR [Расчёт_потребности_в_кадрах_Столбцы_2024] IN ([1004],[1022],[1006],[1007],[1017],[1016],[1021],[1005])
	) pvt3 ON
		pvt2.Врачи=pvt3.Врачи

	LEFT JOIN
	(	
		SELECT [Расчёт_потребности_в_кадрах_Столбцы_2024]
				,_Расчёт_потребности_в_кадрах_Строки_2024.врачебная_должность as Врачи
				,[Value]

		FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
		INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
		WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024<=1066 AND Расчёт_потребности_в_кадрах_Строки_2024 IN (1039)
	) t3
	PIVOT
	(
		SUM(Value) FOR [Расчёт_потребности_в_кадрах_Столбцы_2024] IN ([1004],[1022],[1006],[1007],[1017],[1016],[1021],[1005])
	) pvt4 ON
		pvt2.Врачи=pvt4.Врачи
) a ON
	a.Врачи = pvt.Врачи
------------------------------------------------
LEFT JOIN 
(
		SELECT Календарный_год,
			Период,
			Субъект_РФ,
			врачи = N'Врачи, всего',
			Среднее_время_доезда_скорой_медицинской_помощи_до_места_вызова as N'постоянные_J_13',
			Доля_персонала_скорой_медицинской_помощи_старше_трудоспособного_возраста_врачи_от_числа_врачей as N'постоянные_J_21',
			Число_станций_СМП as N'постоянные_J_15',
			Число_подстанций_постов_трассовых_пунктов_СМП as N'постоянные_J_16',
			Наличие_оперативного_отдела as N'постоянные_J_14',
			Количество_станций_и_отделений_СМП_в_которых_оказывается_ПМСП_в_амбулаторных_условиях_врачами as N'постоянные_J_17',
			Количество_станций_и_отделений_СМП_в_которых_руководители_основные_работники_из_числа_врачей as N'постоянные_J_19',
			Доля_населения_субъекта_проживающего_в_районах_Крайнего_Севера_и_приравненных_к_ним_территориям as N'постоянные_J_9',
			Доля_населения_субъекта_РФ_проживающего_в_сельской_местности as N'постоянные_J_10',
			Доля_населения_проживающего_в_населенных_пунктах_отдаленных_от_областного_центра as N'постоянные_J_12',
			J_27_Интегральный_территориальный_коэффициент_для_корректировки_числа_коек = 1/(iif(Доля_населения_субъекта_проживающего_в_районах_Крайнего_Севера_и_приравненных_к_ним_территориям=1003,0.95,iif(Доля_населения_субъекта_проживающего_в_районах_Крайнего_Севера_и_приравненных_к_ним_территориям=1002,0.97,1))*iif(Доля_населения_субъекта_РФ_проживающего_в_сельской_местности=1003,0.9,iif(Доля_населения_субъекта_РФ_проживающего_в_сельской_местности=1005,0.95,1)))*
																				iif(Доля_населения_проживающего_в_населенных_пунктах_отдаленных_от_областного_центра=1003,1.1,
																				iif(Доля_населения_проживающего_в_населенных_пунктах_отдаленных_от_областного_центра=1005,1.15,1)),
			Доля_персонала_скорой_медицинской_помощи_старше_трудоспособного_возраста_СМП_от_числа_СМП as N'постоянные_J_22',
			Количество_станций_и_отделений_СМП_в_которых_оказывается_ПМСП_в_амбулаторных_условиях_средним_МП as N'постоянные_J_18',
			Количество_станций_и_отделений_СМП_в_которых_руководители_основные_работники_из_числа_СП as N'постоянные_J_20',
			Число_должностей_медицинских_сестер_работающих_с_1_должностью_на_приеме_с_врачом_общей_практики as N'постоянные_J_23',
			Число_должностей_медицинских_сестер_работающих_с_1_должностью_на_приеме_с_врачом_педиатром_уч as N'постоянные_J_24',
			Число_должностей_медицинских_сестер_работающих_с_1_должностью_на_приеме_с_врачом_терапевтом_уч as N'постоянные_J_25',
			Число_должностей_медицинских_сестер_работающих_с_1_должностью_на_приеме_с_врачом_другой_долж as N'постоянные_J_26'
		FROM _Расчёт_потребности_в_кадрах_Формы
		WHERE Субъект_РФ=@Region
) t2 ON
	1=1

----------------------------------
LEFT JOIN 
(
		SELECT Календарный_год,
			Период,
			Субъект_РФ,
			врачи = N'Врачи, всего',
			[Расчёт_потребности_в_кадрах_Столбцы_2024]
			,[Value]

		FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
		INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
		WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024<=1066 AND Расчёт_потребности_в_кадрах_Строки_2024 IN (1012)
) t3 ON
	1=1
LEFT JOIN 
(
		SELECT Календарный_год,
			Период,
			Субъект_РФ,
			врачи = N'Врачи, всего',
			[Расчёт_потребности_в_кадрах_Столбцы_2024]
			,[Value]

		FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
		INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
		WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024<=1066 AND Расчёт_потребности_в_кадрах_Строки_2024 IN (1013)
) t4 ON
	1=1
LEFT JOIN 
(
		SELECT Календарный_год,
			Период,
			Субъект_РФ,
			врачи = N'Врачи, всего',
			[Расчёт_потребности_в_кадрах_Столбцы_2024]
			,[Value]

		FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
		INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
		WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024<=1066 AND Расчёт_потребности_в_кадрах_Строки_2024 IN (1014)
) t5 ON
	1=1
----------------------------------------------------------
LEFT JOIN
(

SELECT [Сумма_C_без_СМП]=sum(
			CASE pvt.номер_строки
				WHEN 70 THEN 0
				ELSE isnull([1011],0)/100
END),
		[Сумма_C]=sum(isnull([1011],0)/100),
		Врачи= N'Врачи, всего'
		/*pvt.номер_строки,
		[постоянные_J_13],
		[постоянные_J_21],
		[постоянные_J_15],
		[постоянные_J_16],
		[постоянные_J_14],
		[постоянные_J_17],
		[постоянные_J_19],
		[постоянные_J_9],
		[постоянные_J_10],
		[постоянные_J_12],
		[J_27_Интегральный_территориальный_коэффициент_для_корректировки_числа_коек],
		[постоянные_J_22],
		[постоянные_J_18],
		[постоянные_J_20],
		[постоянные_J_23],
		[постоянные_J_24],
		[постоянные_J_25],
		[постоянные_J_26],
		[1008] as N'переменные_C_97',
		[1009] as N'переменные_D_97',
		[1010] as N'переменные_E_97',
		[1011]/100 as N'переменные_F_97',
		[1023] as N'постоянные_J_87',
		t3.Value as N'переменные_F_31',
		t4.Value as N'переменные_F_32',
		t5.Value as N'переменные_F_33',
		[Столбец_I] = CASE pvt.Врачи
			WHEN N'общей практики (семейные)' THEN iif(t3.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t3.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
			WHEN N'педиатры участковые (включая педиатров участковых приписных участков)' THEN iif(t5.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t5.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
			WHEN N'терапевты участковые' THEN iif(t4.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t4.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
			ELSE round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0)
		END,
		[1024] as N'постоянные_C_250',
		ceiling(round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0)*isnull([1024],0)/100) as N'Столбец_J',
		isnull([1025],0) as N'постоянные_D_250',
		isnull([1026],0) as N'постоянные_E_250',
		ceiling((isnull([1025],0) + isnull([1026],0))/100 * 
		sum(
				CASE pvt.Врачи
					WHEN N'общей практики (семейные)' THEN iif(t3.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t3.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
					WHEN N'педиатры участковые (включая педиатров участковых приписных участков)' THEN iif(t5.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t5.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
					WHEN N'терапевты участковые' THEN iif(t4.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t4.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
					ELSE round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0)
				END
			) over (partition by 1)
		) as N'Столбец_K',
		isnull([1027],0) as N'постоянные_F_250',
		ceiling((isnull([1027],0))/100 * 
			sum(
				CASE pvt.Врачи
					WHEN N'общей практики (семейные)' THEN iif(t3.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t3.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
					WHEN N'педиатры участковые (включая педиатров участковых приписных участков)' THEN iif(t5.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t5.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
					WHEN N'терапевты участковые' THEN iif(t4.Value>=round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0),t4.Value,round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0))
					ELSE round((isnull([1008],0)+isnull([1009],0))/iif(isnull([1023],0)=0,3200,isnull([1023],0)),0)
				END
				) over (partition by 1)
			) as N'Столбец_L',
		[1028] as N'постоянные_G_250',
		[1029] as N'постоянные_H_250',
		[1030] as N'постоянные_I_250',
		[1031] as N'постоянные_J_250',
		[переменные_C_44], 
		[постоянные_K_44],
		[переменные_C_46],
		[постоянные_K_46],
		[переменные_C_63],
		[постоянные_K_63],
		CEILING(isnull([переменные_C_44],0)/iif(isnull([постоянные_K_44],0)=0,10,[постоянные_K_44]))+CEILING(isnull([переменные_C_46],0)/iif(isnull([постоянные_K_46],0)=0,10,[постоянные_K_46]))+CEILING(isnull([переменные_C_63],0)/iif(isnull([постоянные_K_63],0)=0,10,[постоянные_K_63])) as N'Столбец_M',
		[переменные_E_44],
		[переменные_F_44],
		[постоянные_D_35],
		[постоянные_C_35],
		[постоянные_J_35],
		[переменные_D_44],
		[переменные_E_46],
		[переменные_F_46],
		[постоянные_D_37],
		[постоянные_C_37],
		[постоянные_J_37],
		[переменные_D_46],
		[переменные_E_63],
		[переменные_F_63],
		[постоянные_D_54],
		[постоянные_C_54],
		[постоянные_J_54],
		[переменные_D_63],
		CEILING((max([J_27_Интегральный_территориальный_коэффициент_для_корректировки_числа_коек]) over (partition by 1))*((isnull([переменные_E_44],0)+isnull([переменные_F_44],0))*isnull([постоянные_D_35],0)/iif(isnull([постоянные_C_35],0)=0,334,[постоянные_C_35])/iif(isnull([постоянные_J_35],0)=0,15,[постоянные_J_35])
+(isnull([переменные_E_46],0)+isnull([переменные_F_46],0))*isnull([постоянные_D_37],0)/iif(isnull([постоянные_C_37],0)=0,334,[постоянные_C_37])/iif(isnull([постоянные_J_37],0)=0,15,[постоянные_J_37])
+(isnull([переменные_E_63],0)+isnull([переменные_F_63],0))*isnull([постоянные_D_54],0)/iif(isnull([постоянные_C_54],0)=0,334,[постоянные_C_54])/iif(isnull([постоянные_J_54],0)=0,15,[постоянные_J_54]))) as N'Столбец_O',
		CEILING(isnull([1028],0)*0.01*CEILING([J_27_Интегральный_территориальный_коэффициент_для_корректировки_числа_коек]*((isnull([переменные_E_44],0)+isnull([переменные_F_44],0))*isnull([постоянные_D_35],0)/iif(isnull([постоянные_C_35],0)=0,334,[постоянные_C_35])/iif(isnull([постоянные_J_35],0)=0,15,[постоянные_J_35])
+(isnull([переменные_E_46],0)+isnull([переменные_F_46],0))*isnull([постоянные_D_37],0)/iif(isnull([постоянные_C_37],0)=0,334,[постоянные_C_37])/iif(isnull([постоянные_J_37],0)=0,15,[постоянные_J_37])
+(isnull([переменные_E_63],0)+isnull([переменные_F_63],0))*isnull([постоянные_D_54],0)/iif(isnull([постоянные_C_54],0)=0,334,[постоянные_C_54])/iif(isnull([постоянные_J_54],0)=0,15,[постоянные_J_54])))) as N'Столбец_P',
		CEILING((isnull([1029],0) + isnull([1030],0))*0.01*
		(
			sum(
				ceiling(
							(
								[J_27_Интегральный_территориальный_коэффициент_для_корректировки_числа_коек]
							)*
							(
								(
									isnull([переменные_E_44],0)+isnull([переменные_F_44],0)
								)*
								isnull([постоянные_D_35],0)/
								iif(isnull([постоянные_C_35],0)=0,334,[постоянные_C_35])/
								iif(isnull([постоянные_J_35],0)=0,15,[постоянные_J_35])+
								(
									isnull([переменные_E_46],0)+isnull([переменные_F_46],0)
								)*
								isnull([постоянные_D_37],0)/
								iif(isnull([постоянные_C_37],0)=0,334,[постоянные_C_37])/
								iif(isnull([постоянные_J_37],0)=0,15,[постоянные_J_37])+
								(
									isnull([переменные_E_63],0)+isnull([переменные_F_63],0)
								)*
								isnull([постоянные_D_54],0)/
								iif(isnull([постоянные_C_54],0)=0,334,[постоянные_C_54])/
								iif(isnull([постоянные_J_54],0)=0,15,[постоянные_J_54])
							)
						)
				) over (partition by 1)
		)
		
		) as N'Столбец_Q',
		CEILING((isnull([1031],0))*0.01*(sum(CEILING(([J_27_Интегральный_территориальный_коэффициент_для_корректировки_числа_коек])*((isnull([переменные_E_44],0)+isnull([переменные_F_44],0))*isnull([постоянные_D_35],0)/iif(isnull([постоянные_C_35],0)=0,334,[постоянные_C_35])/iif(isnull([постоянные_J_35],0)=0,15,[постоянные_J_35])
+(isnull([переменные_E_46],0)+isnull([переменные_F_46],0))*isnull([постоянные_D_37],0)/iif(isnull([постоянные_C_37],0)=0,334,[постоянные_C_37])/iif(isnull([постоянные_J_37],0)=0,15,[постоянные_J_37])
+(isnull([переменные_E_63],0)+isnull([переменные_F_63],0))*isnull([постоянные_D_54],0)/iif(isnull([постоянные_C_54],0)=0,334,[постоянные_C_54])/iif(isnull([постоянные_J_54],0)=0,15,[постоянные_J_54])))) over (partition by 1))) as N'Столбец_R',
		CEILING(isnull([переменные_D_44],0)/iif(isnull([постоянные_K_44],0)=0,10,[постоянные_K_44]))+CEILING(isnull([переменные_D_46],0)/iif(isnull([постоянные_K_46],0)=0,10,[постоянные_K_46]))+CEILING(isnull([переменные_D_63],0)/iif(isnull([постоянные_K_63],0)=0,10,[постоянные_K_63])) as N'Столбец_S',
		[1001] as [D19,D21:D26],
		[1002] as [E19:E21:E26],
		[1003] as [F19:F21:F26]*/,
		[Столбец_D]=sum(CASE pvt.Врачи 
			WHEN N'Врачи, всего' THEN ceiling((isnull([1001],0)*4 + isnull([1002],0)*2 + isnull([1003],0))*iif(isnull([постоянные_J_13],0)<=40 AND isnull([постоянные_J_13],0)>20,1.01,iif(isnull([постоянные_J_13],0)>40 AND isnull([постоянные_J_13],0)<=60,1.02,iif(isnull([постоянные_J_13],0)>60,1.03,1)))*iif(isnull([постоянные_J_21],0)=1010,1.01,iif(isnull([постоянные_J_21],0)=1011,1.02,1)))
			ELSE NULL
		END),
		[Столбец_E]=sum(CASE pvt.Врачи 
			WHEN N'Врачи, всего' THEN ceiling((isnull([постоянные_J_15],0)+isnull([постоянные_J_16],0))*iif(isnull([постоянные_J_14],0)=1000,0.3,1)*iif(isnull([постоянные_J_21],0)=1010,1.01,iif(isnull([постоянные_J_21],0)=1011,1.02,1)))
			ELSE NULL
		END),
		[Столбец_F]=sum(CASE pvt.Врачи
			WHEN N'Врачи, всего' THEN ceiling(isnull([постоянные_J_17],0)*iif(isnull([постоянные_J_13],0)<=40,1.01,iif(isnull([постоянные_J_13],0)>40 AND isnull([постоянные_J_13],0)<=60,1.02,iif(isnull([постоянные_J_13],0)>60,1.03,1)))*iif(isnull([постоянные_J_21],0)=1010,1.01,iif(isnull([постоянные_J_21],0)=1011,1.02,1))/0.25)
			ELSE NULL
		END),
		[Столбец_G]=sum(CASE pvt.Врачи
			WHEN N'Врачи, всего' THEN ceiling((isnull([постоянные_J_15],0)+isnull([постоянные_J_16],0))*iif(isnull([постоянные_J_19],0)>=3,1.3,iif(isnull([постоянные_J_19],0)=2,1.2,1))*iif(isnull([постоянные_J_21],0)=1010,1.01,iif(isnull([постоянные_J_21],0)=1011,1.02,1)))
			ELSE NULL
		END)/*,
		isnull([1033],0) as [D_7],
		isnull([1034],0) as [E_7],
		isnull([1035],0) as [F_7],
		isnull([1036],0) as [G_7],
		isnull([1037],0) as [I_7],
		isnull([1038],0) as [J_7],
		isnull([1039],0) as [K_7],
		isnull([1040],0) as [L_7]*/
FROM  
(
	SELECT [Расчёт_потребности_в_кадрах_Столбцы_2024]
			  ,_Расчёт_потребности_в_кадрах_Строки_2024.alias as Врачи
		  ,_Расчёт_потребности_в_кадрах_Строки_2024.номер_строки as номер_строки

		  ,[Value]

	FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
	INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
		_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
	WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024 < 1174 AND Расчёт_потребности_в_кадрах_Строки_2024>1066

	UNION ALL

	SELECT 
			Расчёт_потребности_в_кадрах_Столбцы_2024,
			Врачи = N'Врачи, всего',
				0 as номер_строки,
				Value
	FROM __Расчет_потребности_в_кадрах_2024_год
	INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = __Расчет_потребности_в_кадрах_2024_год.Расчёт_потребности_в_кадрах_Строки_2024
	WHERE Расчёт_потребности_в_кадрах_Строки_2024 IN (1004,1006,1007,1008,1009,1010,1011) AND Субъект_РФ=@Region
) t
PIVOT
(
	SUM(Value) FOR [Расчёт_потребности_в_кадрах_Столбцы_2024] IN ([1001],[1002],[1003],[1008],[1009],[1010],[1011],[1023],[1024],[1025],[1026],[1027],[1028],[1029],[1030],[1031],[1033],[1034],[1035],[1036],[1037],[1038],[1039],[1040])
) pvt
-------------------------------------	
LEFT JOIN
(
	SELECT pvt2.Врачи, 
			pvt2.[1004] as N'переменные_C_44', 
			pvt2.[1022] as N'постоянные_K_44',
			pvt3.[1004] as N'переменные_C_46',
			pvt3.[1022] as N'постоянные_K_46',
			pvt4.[1004] as N'переменные_C_63',
			pvt4.[1022] as N'постоянные_K_63',
			pvt2.[1006] as N'переменные_E_44',
			pvt2.[1007] as N'переменные_F_44',
			pvt2.[1017] as N'постоянные_D_35',
			pvt2.[1016] as N'постоянные_C_35',
			pvt2.[1021] as N'постоянные_J_35',
			pvt2.[1005] as N'переменные_D_44',
			pvt3.[1006] as N'переменные_E_46',
			pvt3.[1007] as N'переменные_F_46',
			pvt3.[1017] as N'постоянные_D_37',
			pvt3.[1016] as N'постоянные_C_37',
			pvt3.[1021] as N'постоянные_J_37',
			pvt3.[1005] as N'переменные_D_46',
			pvt4.[1006] as N'переменные_E_63',
			pvt4.[1007] as N'переменные_F_63',
			pvt4.[1017] as N'постоянные_D_54',
			pvt4.[1016] as N'постоянные_C_54',
			pvt4.[1021] as N'постоянные_J_54',
			pvt4.[1005] as N'переменные_D_63'
	FROM
	(	
		SELECT [Расчёт_потребности_в_кадрах_Столбцы_2024]
				,_Расчёт_потребности_в_кадрах_Строки_2024.врачебная_должность as Врачи
				,[Value]

		FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
		INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
		WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024<=1066 AND Расчёт_потребности_в_кадрах_Строки_2024 NOT IN (1022,1039,1021,1040,1056,1062,1052) 
	) t2
	PIVOT
	(
		SUM(Value) FOR [Расчёт_потребности_в_кадрах_Столбцы_2024] IN ([1004],[1022],[1006],[1007],[1017],[1016],[1021],[1005])
	) pvt2

	LEFT JOIN
	(	
		SELECT [Расчёт_потребности_в_кадрах_Столбцы_2024]
				,_Расчёт_потребности_в_кадрах_Строки_2024.врачебная_должность as Врачи
				,[Value]

		FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
		INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
		WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024<=1066 AND Расчёт_потребности_в_кадрах_Строки_2024 IN (1022,1021,1040,1056,1062,1052)
	) t3
	PIVOT
	(
		SUM(Value) FOR [Расчёт_потребности_в_кадрах_Столбцы_2024] IN ([1004],[1022],[1006],[1007],[1017],[1016],[1021],[1005])
	) pvt3 ON
		pvt2.Врачи=pvt3.Врачи

	LEFT JOIN
	(	
		SELECT [Расчёт_потребности_в_кадрах_Столбцы_2024]
				,_Расчёт_потребности_в_кадрах_Строки_2024.врачебная_должность as Врачи
				,[Value]

		FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
		INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
		WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024<=1066 AND Расчёт_потребности_в_кадрах_Строки_2024 IN (1039)
	) t3
	PIVOT
	(
		SUM(Value) FOR [Расчёт_потребности_в_кадрах_Столбцы_2024] IN ([1004],[1022],[1006],[1007],[1017],[1016],[1021],[1005])
	) pvt4 ON
		pvt2.Врачи=pvt4.Врачи
) a ON
	a.Врачи = pvt.Врачи
------------------------------------------------
LEFT JOIN 
(
		SELECT Календарный_год,
			Период,
			Субъект_РФ,
			врачи = N'Врачи, всего',
			Среднее_время_доезда_скорой_медицинской_помощи_до_места_вызова as N'постоянные_J_13',
			Доля_персонала_скорой_медицинской_помощи_старше_трудоспособного_возраста_врачи_от_числа_врачей as N'постоянные_J_21',
			Число_станций_СМП as N'постоянные_J_15',
			Число_подстанций_постов_трассовых_пунктов_СМП as N'постоянные_J_16',
			Наличие_оперативного_отдела as N'постоянные_J_14',
			Количество_станций_и_отделений_СМП_в_которых_оказывается_ПМСП_в_амбулаторных_условиях_врачами as N'постоянные_J_17',
			Количество_станций_и_отделений_СМП_в_которых_руководители_основные_работники_из_числа_врачей as N'постоянные_J_19',
			Доля_населения_субъекта_проживающего_в_районах_Крайнего_Севера_и_приравненных_к_ним_территориям as N'постоянные_J_9',
			Доля_населения_субъекта_РФ_проживающего_в_сельской_местности as N'постоянные_J_10',
			Доля_населения_проживающего_в_населенных_пунктах_отдаленных_от_областного_центра as N'постоянные_J_12',
			J_27_Интегральный_территориальный_коэффициент_для_корректировки_числа_коек = 1/(iif(Доля_населения_субъекта_проживающего_в_районах_Крайнего_Севера_и_приравненных_к_ним_территориям=1003,0.95,iif(Доля_населения_субъекта_проживающего_в_районах_Крайнего_Севера_и_приравненных_к_ним_территориям=1002,0.97,1))*iif(Доля_населения_субъекта_РФ_проживающего_в_сельской_местности=1003,0.9,iif(Доля_населения_субъекта_РФ_проживающего_в_сельской_местности=1005,0.95,1)))*
																				iif(Доля_населения_проживающего_в_населенных_пунктах_отдаленных_от_областного_центра=1003,1.1,
																				iif(Доля_населения_проживающего_в_населенных_пунктах_отдаленных_от_областного_центра=1005,1.15,1)),
			Доля_персонала_скорой_медицинской_помощи_старше_трудоспособного_возраста_СМП_от_числа_СМП as N'постоянные_J_22',
			Количество_станций_и_отделений_СМП_в_которых_оказывается_ПМСП_в_амбулаторных_условиях_средним_МП as N'постоянные_J_18',
			Количество_станций_и_отделений_СМП_в_которых_руководители_основные_работники_из_числа_СП as N'постоянные_J_20',
			Число_должностей_медицинских_сестер_работающих_с_1_должностью_на_приеме_с_врачом_общей_практики as N'постоянные_J_23',
			Число_должностей_медицинских_сестер_работающих_с_1_должностью_на_приеме_с_врачом_педиатром_уч as N'постоянные_J_24',
			Число_должностей_медицинских_сестер_работающих_с_1_должностью_на_приеме_с_врачом_терапевтом_уч as N'постоянные_J_25',
			Число_должностей_медицинских_сестер_работающих_с_1_должностью_на_приеме_с_врачом_другой_долж as N'постоянные_J_26'
		FROM _Расчёт_потребности_в_кадрах_Формы
		WHERE Субъект_РФ=@Region
) t2 ON
	1=1

----------------------------------
LEFT JOIN 
(
		SELECT Календарный_год,
			Период,
			Субъект_РФ,
			врачи = N'Врачи, всего',
			[Расчёт_потребности_в_кадрах_Столбцы_2024]
			,[Value]

		FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
		INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
		WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024<=1066 AND Расчёт_потребности_в_кадрах_Строки_2024 IN (1012)
) t3 ON
	1=1
LEFT JOIN 
(
		SELECT Календарный_год,
			Период,
			Субъект_РФ,
			врачи = N'Врачи, всего',
			[Расчёт_потребности_в_кадрах_Столбцы_2024]
			,[Value]

		FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
		INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
		WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024<=1066 AND Расчёт_потребности_в_кадрах_Строки_2024 IN (1013)
) t4 ON
	1=1
LEFT JOIN 
(
		SELECT Календарный_год,
			Период,
			Субъект_РФ,
			врачи = N'Врачи, всего',
			[Расчёт_потребности_в_кадрах_Столбцы_2024]
			,[Value]

		FROM [ASMMS].[dbo].[__Расчет_потребности_в_кадрах_2024_год]
		INNER JOIN _Расчёт_потребности_в_кадрах_Строки_2024 ON
			_Расчёт_потребности_в_кадрах_Строки_2024.id = [Расчёт_потребности_в_кадрах_Строки_2024]
		WHERE [Субъект_РФ]=@Region AND Расчёт_потребности_в_кадрах_Строки_2024<=1066 AND Расчёт_потребности_в_кадрах_Строки_2024 IN (1014)
) t5 ON
	1=1

) incl ON
	1=1
ORDER BY номер_строки
