INSERT INTO [ASMMS].[dbo].[_Мониторинг_РП_оценка_форма]
(
    [Name]
    ,[Регион]
    ,[Статус]
    ,[Календарный_год]
    ,[Направление]
)
SELECT 
    m.[Name]
    ,r.[Id] AS [Регион]
    ,m.[Статус]
    ,m.[Календарный_год]
    ,m.[Направление]
FROM [ASMMS].[dbo].[_Мониторинг_РП_оценка_форма] m
CROSS JOIN [ASMMS].[dbo].[_Регион] r
WHERE m.[Регион] = 1040
    AND r.[Id] != 1040  -- Исключаем регион 1040, чтобы не создавать дубликаты
    AND r.[HierarchicalLevel] = 3
ORDER BY [Направление], [Регион]