SELECT [Id]
      ,[Name]
      ,[alias]
      ,[Единица_измерения]
      ,[Значение_показателя___план]
      ,[Значение_показателя___факт]
      ,t1.Name as Достижение_результата_Name
      ,t2.Name as Статус_результата_Name
      ,[Описание_причины_отклонений_прилагаемые_решения]
      ,_Регион.Name as Регион_Name
      ,[Календарный_год]
      ,[Период]
      ,JSON_VALUE(esign, '$.items[0].certificate.name') + ' ' + JSON_VALUE(esign, '$.items[0].certificate.fromDate') as Signer
  FROM [ASMMS].[dbo].[_Медицинская_реабилитация_Мониторинг_РП_показатели] t
  INNER JOIN _Регион ON _Регион.id = t.[Регион]
  INNER JOIN _Медицинская_реабилитация_Мониторинг_РП_Достижение_результата t1 ON 
        t1.Id = t.[Достижение_результата]
  INNER JOIN _Медицинская_реабилитация_Мониторинг_РП_статус_результата  t2 ON 
        t2.Id = t.[Статус_результата]
  INNER JOIN _Медицинская_реабилитация_Мониторинг_РП_форма t3 ON 
        t3.[Регион] =t.[Регион] and t3.[Календарный_год] = t.[Календарный_год] and t3.[Период] = t.[Период]
