  INSERT INTO [ASMMS].[dbo].[_Медицинская_реабилитация_2_Оснащение_2023_сущность]
  (
		[Календарный_год]
      ,[Период]
      ,[Регион]
      ,[Инициатор]
      ,[Статус]
      ,[Комментарий]
      ,[Изменение_отчета]
      ,[Последний_комментарий]
      ,[Группа_форм]
      ,[Form]

  )
  SELECT [Календарный_год]
      ,1018
      ,[Регион]
      ,[Инициатор]
      ,[Статус] = CASE Form
		WHEN 20027 THEN 5130
		WHEN 20032 THEN 5167
	END
      ,[Комментарий]
      ,[Изменение_отчета]
      ,[Последний_комментарий]
      ,[Группа_форм]
      ,[Form]
  FROM [ASMMS].[dbo].[_Медицинская_реабилитация_2_Оснащение_2023_сущность]
  WHERE [Календарный_год]=1015 AND [Период]=1017 AND [ФГБУ] IS NULL AND [ФОИВ] IS NULL AND Form IN (20027, 20032)