WITH CTE1 AS (
    SELECT row_number() over (partition by [Генерация], [Регион] order by [Показатель]) as [row_num], [Генерация],[Регион],[Показатель],Value
    FROM [ASMMS].[dbo].[_Мониторинг_РП_БССЗ_Согласование_сущность]
    UNPIVOT (
        Value FOR [Показатель] IN (
            [ГВС_СД_I_Общая_часть_статус],[ГВС_СД_II_2_статус],[ГВС_СД_II_3_статус],[ГВС_СД_II_4_статус],
            [ГВС_СД_II_5_статус],[ГВС_СД_II_6_статус],[ГВС_СД_II_7_статус],[ГВС_СД_II_8_статус],
            [ГВС_СД_II_9_статус],[ГВС_СД_II_10_статус],[ГВС_СД_II_11_статус],[ГВС_СД_II_12_статус],
            [ГВС_СД_II_13_статус],[ГВС_СД_II_14_статус],[ГВС_СД_II_15_статус],[ГВС_СД_II_16_статус],
            [ГВС_СД_III_Другие_приложения_статус]
        )
    ) AS unpvt1
	WHERE Маршрутизация_СД=1
),
CTE2 AS (
    SELECT row_number() over (partition by [Генерация], [Регион] order by [Показатель]) as [row_num], [Генерация], [Регион], [Показатель], Value
    FROM [ASMMS].[dbo].[_Мониторинг_РП_БССЗ_Согласование_сущность]
    UNPIVOT (
        Value FOR [Показатель] IN (
            [ГВС_СД_I_Общая_часть_комментарий],[ГВС_СД_II_2_комментарий],[ГВС_СД_II_3_комментарий],[ГВС_СД_II_4_комментарий],
            [ГВС_СД_II_5_комментарий],[ГВС_СД_II_6_комментарий],[ГВС_СД_II_7_комментарий],[ГВС_СД_II_8_комментарий],
            [ГВС_СД_II_9_комментарий],[ГВС_СД_II_10_комментарий],[ГВС_СД_II_11_комментарий],[ГВС_СД_II_12_комментарий],
            [ГВС_СД_II_13_комментарий],[ГВС_СД_II_14_комментарий],[ГВС_СД_II_15_комментарий],[ГВС_СД_II_16_комментарий],
            [ГВС_СД_III_Другие_приложения_комментарий]
        )
    ) AS unpvt2
	WHERE Маршрутизация_СД=1
)

SELECT CTE1.[Генерация], CTE1.[Регион], CTE1.[Показатель], Статус = CASE CTE1.Value 
    WHEN 1000 THEN N'Не взят в работу'
    WHEN 1001 THEN N'Взят в работу'
    WHEN 1002 THEN N'Отклонено'
    WHEN 1003 THEN N'Согласовано'
END,
CTE2.[Показатель], Комментарий = CTE2.Value
FROM CTE1
INNER JOIN CTE2 ON CTE1.[Генерация]=CTE2.[Генерация] AND CTE1.[Регион]=CTE2.[Регион] AND CTE1.row_num=CTE2.row_num
