-- Вставка в таблицу _Мониторинг_РП_БССЗ_Согласование_сущность
INSERT INTO [ASMMS].[dbo].[_Мониторинг_РП_БССЗ_Согласование_сущность]
([Генерация], [Регион], [Календарный_год], 
 [id_main_object], [Проект], [Дата_и_время_загрузки_проекта], [Комментарий], 
 [Контакты_исполнителя_для_связи], [Статус_рассмотрения_проекта_], [Статус_региона], 
[СД], [Маршрутизация_БССЗ], [Маршрутизация_СД], [Дата_и_время_заключения])
SELECT 
    1 as [Генерация],
    r.Id as [Регион],
    1015 as [Календарный_год],
    f.Id as [id_main_object],
    NULL as [Проект],
    NULL as [Дата_и_время_загрузки_проекта],
    NULL as [Комментарий],
    NULL as [Контакты_исполнителя_для_связи],
    1000 as [Статус_рассмотрения_проекта_],
    1000 as [Статус_региона],
    NULL as [СД],
    NULL as [Маршрутизация_БССЗ],
    1 as [Маршрутизация_СД],
    NULL as [Дата_и_время_заключения]
FROM [ASMMS].[dbo].[_Регион] r
INNER JOIN [ASMMS].[dbo].[_Мониторинг_РП_БССЗ_Согласование_форма] f 
    ON r.Id = f.[Регион] 
    AND f.[Направление] = 1002
WHERE r.HierarchicalLevel=3 AND r.Id<>1040;