INSERT INTO [ASMMS].[dbo].[_Мониторинг_РП_СД_история]
(
    [__CreatedOn],
    [id_main_object],
    [Регион],
    [Отчётная_дата],
    [Статус],
    [Проблемы],
    [Решения],
    [Статус_мероприятия]
)
SELECT 
    GETDATE() AS [__CreatedOn],
    main.[Id] AS [id_main_object],
    main.[Регион],
    CAST(dates.ReportDateStr AS DATE) AS [Отчётная_дата],
    5167 AS [Статус],
    1000,
    1000,
    1000
FROM [ASMMS].[dbo].[_Мониторинг_РП_основная_сущность_СД] main
CROSS JOIN (
    VALUES 
        ('30.09.2025'),
        ('31.12.2025'),
        ('31.03.2026'),
        ('30.06.2026'),
        ('30.09.2026'),
        ('31.12.2026'),
        ('31.03.2027'),
        ('30.06.2027'),
        ('30.09.2027'),
        ('31.12.2027'),
        ('31.03.2028'),
        ('30.06.2028'),
        ('30.09.2028'),
        ('31.12.2028'),
        ('31.03.2029'),
        ('30.06.2029'),
        ('30.09.2029'),
        ('31.12.2029'),
        ('31.03.2030'),
        ('30.06.2030'),
        ('30.09.2030'),
        ('31.12.2030')
) AS dates(ReportDateStr)
WHERE main.[Регион] IS NOT NULL AND main.[__CreatedOn]>'2025-21-10 13:34:20.000';

/****** Проверка количества вставленных записей ******/
SELECT 
    COUNT(*) AS [Количество_вставленных_записей],
    MIN([Отчётная_дата]) AS [Минимальная_дата],
    MAX([Отчётная_дата]) AS [Максимальная_дата]
FROM [ASMMS].[dbo].[_Мониторинг_РП_СД_история] 
WHERE [Статус] = 5167 
  AND [__CreatedOn] >= CAST(GETDATE() AS DATE);