-- Вставка в таблицу _Дети_мониторинг_рп_сущность
INSERT INTO [ASMMS].[dbo].[_Дети_мониторинг_рп_сущность]
([Генерация], [Регион], [Календарный_год], 
 [id_main_object], [Проект], [Дата_и_время_загрузки_проекта], [Комментарий], 
 [Контакты_исполнителя_для_связи], [Статус_рассмотрения_проекта], [Статус_региона])
SELECT 
    1 as [Генерация],
    r.Id as [Регион],
    1015 as [Календарный_год],
    f.Id as [id_main_object],
    NULL as [Проект],
    NULL as [Дата_и_время_загрузки_проекта],
    NULL as [Комментарий],
    NULL as [Контакты_исполнителя_для_связи],
    1000 as [Статус_рассмотрения_проекта],
    1000 as [Статус_региона]
FROM [ASMMS].[dbo].[_Регион] r
INNER JOIN [ASMMS].[dbo].[_Дети_мониторинг_рп_форма] f 
    ON r.Id = f.[Регион]
WHERE r.HierarchicalLevel=3 AND r.Id<>1040;