SELECT [Id]\
        ,ROW_NUMBER() OVER (PARTITION BY [ЕКВ_специальности],[ЕКВ_показатели] ORDER BY [ЕКВ_специальности],[ЕКВ_показатели]) as RowNumber
      ,[ЕКВ_показатели]
      ,[ЕКВ_специальности]
      ,[Календарный_год]
      ,[Период]
      ,[Субъект_РФ]
      ,[Value]
      ,[Value_Text]
      ,[Value_Calculated]
  FROM [ASMMS].[dbo].[__Единовременные_компенсационные_выплаты_приложение_2]
  WHERE [Календарный_год]=1015 and [Период]=1016 and [Субъект_РФ]=1059 and [ЕКВ_специальности] in (1017,1027,1034,1051)


