UPDATE m
SET m.[Статус] = 5167
FROM [ASMMS].[dbo].[_Мониторинг_РП_СД_история] AS m
INNER JOIN [ASMMS].[dbo].[_Мониторинг_РП_основная_сущность_СД] AS s
    ON s.Id = m.[id_main_object]
WHERE s.[Отчетная_дата] = N'2025-30-09'
  AND m.[Отчётная_дата] = N'2025-30-09';

UPDATE [ASMMS].[dbo].[_Мониторинг_РП_основная_сущность_СД]
SET Отчетная_дата=N'2025-30-09'
WHERE ([Регион] IN (1088, 1081, 1032) AND [Направление_мероприятий]=1012) OR ([Регион] IN (1045, 1046, 1088, 1094, 1105, 1136) AND [Направление_мероприятий]=1002);