SELECT [ВОВ_категории_граждан]
      ,[ВОВ_показатели]
      ,[Период]
      ,[Календарный_год]
      ,[Субъект_РФ]
      ,[Value]
FROM [ASMMS].[dbo].[__ВОВ_куб]

SELECT [Id]
      ,[Name]
      ,[старые_наименования]
      ,[номер]
FROM [ASMMS].[dbo].[_ВОВ_показатели]
WHERE [Id] IN (
  1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012,1013,
  1014,1015,1016,1017,1018,1019,1020,1021,1022,1023,1024,1025,1026,1028,
  1032,1033,1034,1035,1036,1037,1038,1039,1040,1041,1042
)

SELECT [Id]
      ,[Name]
      ,[нарастающий_итог]
FROM [ASMMS].[dbo].[_ВОВ_категории_граждан]

SELECT
    [ВОВ_категория_граждан],
    [Период],
    [Календарный_год],
    [Субъект_РФ],
    [1000],[1001],[1002],[1003],[1004],[1005],[1006],[1007],[1008],[1009],[1010],[1011],
    [1012],[1013],[1014],[1015],[1016],[1017],[1018],[1019],[1020],[1021],[1022],[1023],
    [1024],[1025],[1026],[1028],[1032],[1033],[1034],[1035],[1036],[1037],[1038],[1039],
    [1040],[1041],[1042]
FROM (
    SELECT
        c.[Name] AS [ВОВ_категория_граждан],
        v.[Период],
        v.[Календарный_год],
        v.[Субъект_РФ],
        p.[id] as [Показатель],
        v.[Value]
    FROM [ASMMS].[dbo].[__ВОВ_куб] v
    JOIN [ASMMS].[dbo].[_ВОВ_показатели] p
         ON v.[ВОВ_показатели] = p.[Id]
    JOIN [ASMMS].[dbo].[_ВОВ_категории_граждан] c
         ON v.[ВОВ_категории_граждан] = c.[Id]
    WHERE p.[Id] IN (
      1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012,1013,
      1014,1015,1016,1017,1018,1019,1020,1021,1022,1023,1024,1025,1026,1028,
      1032,1033,1034,1035,1036,1037,1038,1039,1040,1041,1042
    )
) AS SourceTable
PIVOT
(
    MAX([Value])
    FOR [Показатель] IN (
        [1000],[1001],[1002],[1003],[1004],[1005],[1006],[1007],[1008],[1009],[1010],[1011],
        [1012],[1013],[1014],[1015],[1016],[1017],[1018],[1019],[1020],[1021],[1022],[1023],
        [1024],[1025],[1026],[1028],[1032],[1033],[1034],[1035],[1036],[1037],[1038],[1039],
        [1040],[1041],[1042]
    )
) AS PivotTable
ORDER BY [ВОВ_категория_граждан], [Календарный_год], [Период], [Субъект_РФ]
